Revit 2024 API
AnalyticalPanel Class
 An element that represents a surface in the Structural Analytical Model.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2023
Syntax
C#
public class AnalyticalPanel : AnalyticalSurfaceBase
Visual Basic
Public Class AnalyticalPanel _
	Inherits AnalyticalSurfaceBase
Visual C++
public ref class AnalyticalPanel : public AnalyticalSurfaceBase
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.Structure.AnalyticalElement
 Autodesk.Revit.DB.Structure.AnalyticalSurfaceBase
 Autodesk.Revit.DB.Structure.AnalyticalPanel
See Also
AnalyticalPanel Members
Autodesk.Revit.DB.Structure Namespace